#5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма.
# Например, прибыль — выручка больше издержек, или убыток — издержки больше выручки.
# Выведите соответствующее сообщение.

plus = int(input('Введите значение прибыли: '))
minus = int(input('Введите значение издержек: '))
if plus > minus:
    print('Выручка больше издержек')
elif:
    print('Фирма работает в убыток')
